/*====================================================================================================================
 * gulpfile
 *====================================================================================================================*/

var del = require("del");
var gulp = require("gulp");
var minifyCss = require("gulp-minify-css");
var rename = require("gulp-rename");
var sass = require("gulp-ruby-sass");

/*--------------------------------------------------------------------------------------------------------------------
 * お掃除タスク
 *--------------------------------------------------------------------------------------------------------------------*/

gulp.task("clean", del.bind(null, ["dist", ".sass-cache"]));

/*--------------------------------------------------------------------------------------------------------------------
 * ビルドタスク
 *--------------------------------------------------------------------------------------------------------------------*/

gulp.task("build", [
    "build:fonts",
    "build:images",
    "build:styles",
]);

/*--------------------------------------------------------------------------------------------------------------------
 * ビルドタスク: フォント
 *--------------------------------------------------------------------------------------------------------------------*/

gulp.task("build:fonts", function() {
    return gulp.src([
        "node_modules/bootstrap-sass/assets/fonts/bootstrap/**/*",
        "node_modules/font-awesome/fonts/**/*",
    ])
        .pipe(gulp.dest("dist/fonts"));
});

/*--------------------------------------------------------------------------------------------------------------------
 * ビルドタスク: 画像
 *--------------------------------------------------------------------------------------------------------------------*/

gulp.task("build:images", function() {
    return gulp.src([
        "src/images/**/*",
        "!src/images/**/*.sai",
    ])
        .pipe(gulp.dest("dist/images"));
});

/*--------------------------------------------------------------------------------------------------------------------
 * ビルドタスク: スタイルシート
 *--------------------------------------------------------------------------------------------------------------------*/

gulp.task("build:styles", function() {
    return sass("src/styles/rakugakibox.net.scss", {
        bundleExec: true,
        emitCompileError: true,
        lineNumbers: true,
        loadPath: [
            "node_modules/bootstrap-sass/assets/stylesheets",
            "node_modules/font-awesome/scss",
        ],
        style: "expanded",
    })
        .pipe(gulp.dest("dist/styles"))
        .pipe(rename({extname: ".min.css"}))
        .pipe(minifyCss({keepSpecialComments: 0}))
        .pipe(gulp.dest("dist/styles"));
});
